No available couplings to connect standard lengths for this instance of straight.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
 Syntax
  C#
public static FailureDefinitionId FabricationPartOptimizeInvalidConnection { get; }
  Visual Basic
Public Shared ReadOnly Property FabricationPartOptimizeInvalidConnection As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FabricationPartOptimizeInvalidConnection {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures MEPFabricationFailures Class
  Autodesk.Revit.DB Namespace